app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Chemistry"], ["room_number", 69], ["created_at", "2020-03-17 21:30:51.005012"], ["updated_at", "2020-03-17 21:30:51.005012"]]
---
    def create
        school_class = SchoolClass.new(school_class_params(:title, :room_number))
        if school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_and_set_school_class_by_id
        @school_class = SchoolClass.find(params[:id])