app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jeque"], ["last_name", "Fodao"], ["created_at", "2020-03-17 21:54:00.342283"], ["updated_at", "2020-03-17 21:54:00.342283"]]
---
    def create
        student = Student.create(strong_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgenson"], ["updated_at", "2020-03-17 21:55:00.618158"], ["id", 1]]
---
    def update
        student = Student.find(params[:id])
        student.update(strong_params)